#### BAB X (PEMBERSIHAN DATA)

##### Mengenal Data

In [34]:
import pandas as pd
import numpy as np

airdata = pd.read_csv('dataset/airdata.csv', low_memory=False)

In [35]:
airdata.sample(5)

,DateTime,Temperature,Humidity,Wind_Speed,Wind_Direction,NO2_Location_A,NO2_Location_B,NO2_Location_C
8267,12/10/2020 11:00,0.730529,80,17.477621,122.38068,28.28,43.80,61.59
4305,6/28/2020 9:00,20.490528,76,17.418196,288.06050,4.90,6.95,6.65
748,2/1/2020 4:00,7.280528,88,8.311245,184.96974,16.50,21.03,33.10
5408,8/13/2020 8:00,23.460530,56,2.545584,225.00000,21.00,27.13,42.95
6783,10/9/2020 15:00,20.070530,60,14.587776,285.75120,19.85,16.80,67.73

In [36]:
missing_values_count = airdata.isnull().sum()
missing_values_count

DateTime            0
Temperature         0
Humidity            0
Wind_Speed          0
Wind_Direction      0
NO2_Location_A    120
NO2_Location_B    580
NO2_Location_C    132
dtype: int64

In [37]:
total_cells = np.prod(airdata.shape)
total_missing = missing_values_count.sum()

(total_missing / total_cells) * 100

np.float64(1.1839708561020037)

##### Menghapus Nilai Hilang

In [38]:
# Remove all columns with at leats one missing value
columns_with_na_dropped = airdata.dropna(axis=1)
columns_with_na_dropped.head()

        DateTime  Temperature  Humidity  Wind_Speed  Wind_Direction
0  1/1/2020 0:00     2.180529        87    1.484318       75.963760
1  1/1/2020 1:00     1.490529        89    2.741678      113.198590
2  1/1/2020 2:00     1.690529        85    3.563818      135.000000
3  1/1/2020 3:00     1.430529        84    2.811690      129.805570
4  1/1/2020 4:00     0.840529        86    1.800000      126.869896

In [39]:
print("Columns in original dataset: ", airdata.shape[1])
print("Columns with missing values dropped: ", columns_with_na_dropped.shape[1])

Columns in original dataset:  8
Columns with missing values dropped:  5

##### Mengisi nilai kosong

In [40]:
subset_airdata = airdata.loc[:, 'DateTime': 'Temperature'].head()
subset_airdata.fillna(0)

        DateTime  Temperature
0  1/1/2020 0:00     2.180529
1  1/1/2020 1:00     1.490529
2  1/1/2020 2:00     1.690529
3  1/1/2020 3:00     1.430529
4  1/1/2020 4:00     0.840529

##### Noramalisasi Data

In [44]:
from scipy import stats
from mlxtend.preprocessing import minmax_scaling
import seaborn as sns
import matplotlib.pyplot as plt

chicago_population = pd.read_csv('dataset/chicago_population.csv', low_memory=False)
np.random.seed(0)
chicago_population.head()

             name  population  income  latino  black  white  asian  other
0     Rogers Park       54991   39482   0.244  0.263  0.393  0.064  0.036
1      West Ridge       71942   47323   0.204  0.111  0.427  0.225  0.032
2          Uptown       56362   40324   0.142  0.200  0.516  0.114  0.028
3  Lincoln Square       39493   57749   0.191  0.038  0.631  0.111  0.029
4    North Center       31867   81524   0.136  0.023  0.773  0.045  0.022